# 7. Даны две строки. Создать список в который поместить те символы, которые есть в обеих строках,
# но в каждой только по одному разу.

# my_str_1 = 'сихафазатрон'
# my_str_2 = 'ликвидность'
# my_result_1 = []
# my_result_2 = []
# for i in my_str_1:
#     if my_str_1.count(i) == 1:
#         my_result_1.append(i)
# for i in my_str_2:
#     if my_str_2.count(i) == 1:
#         my_result_2.append(i)
# my_result = set(my_result_1).intersection(set(my_result_2))
# print(my_result)

# my_str_1 = 'сихафазатрон'
# my_str_2 = 'ликвидность'
# my_result = []
#
# for i in my_str_1:
#     if my_str_1.count(i) == 1 and my_str_2.count(i) == 1:
#         my_result.append(i)
# print(my_result)

##################################################################################################

